# Code Samples From Large Group

In [3]:
import pandas as pd

dataset = "/home/jovyan/datasets/ist256/UCDP-Georeferenced-Event-Dataset/v21.1/ged211.csv"

df = pd.read_csv(dataset)

/opt/conda/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3251: DtypeWarning: Columns (47) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [6]:
 confs = df[ ["year","code_status","conflict_name" ] ]

In [8]:
confs[ confs.year == 1989 ]

        year code_status                        conflict_name
1       1989       Clear              Afghanistan: Government
2       1989       Clear              Afghanistan: Government
3       1989       Clear              Afghanistan: Government
4       1989       Clear              Afghanistan: Government
5       1989       Clear              Afghanistan: Government
...      ...         ...                                  ...
257950  1989       Clear  Government of Venezuela - Civilians
261788  1989       Clear                   Renamo - Civilians
261789  1989       Clear                   Renamo - Civilians
261859  1989       Clear                   Renamo - Civilians
261860  1989       Clear                   Renamo - Civilians

[2374 rows x 3 columns]

In [9]:
stocks = pd.read_json("https://raw.githubusercontent.com/mafudge/advanced-databases/main/datasets/json-samples/stocks.json")

stocks

  symbol    price
0   AAPL   126.82
1   AMZN  3098.12
2     FB   251.11
3   GOOG  1725.05
4    IBM   128.39
5   MSFT   212.55
6    NET    78.00
7   NFLX   497.00
8   TSLA   823.80
9   TWTR    45.11

In [10]:
bigstocks  = stocks[ stocks['price'] > 1000 ]
bigstocks

  symbol    price
1   AMZN  3098.12
3   GOOG  1725.05

In [13]:
for s in bigstocks.to_records():
    print(f"{s['symbol']} is a big stock!")

AMZN is a big stock!
GOOG is a big stock!

In [18]:
stocks

  symbol    price
0   AAPL   126.82
1   AMZN  3098.12
2     FB   251.11
3   GOOG  1725.05
4    IBM   128.39
5   MSFT   212.55
6    NET    78.00
7   NFLX   497.00
8   TSLA   823.80
9   TWTR    45.11

In [19]:
students = [
    {'name' : 'mike', 'gpa' : 2.1},
    {'name' : 'dan', 'gpa' : 2.7},
    {'name' : 'deb', 'gpa' : 3.4}
]

In [20]:
student_df = pd.DataFrame(students)

In [21]:
student_df

   name  gpa
0  mike  2.1
1   dan  2.7
2   deb  3.4

In [22]:
people = [
    {'name' : 'mike', 'age' : 100},
    {'name' : 'dan', 'age' : 50},
    {'name' : 'deb', 'credit_score' : 880}
]

In [23]:
people_df = pd.DataFrame(people)
people_df

   name    age  credit_score
0  mike  100.0           NaN
1   dan   50.0           NaN
2   deb    NaN         880.0

In [24]:
people_df.columns

Index(['name', 'age', 'credit_score'], dtype='object')

In [26]:
df.columns

Index(['id', 'relid', 'year', 'active_year', 'code_status', 'type_of_violence',
       'conflict_dset_id', 'conflict_new_id', 'conflict_name', 'dyad_dset_id',
       'dyad_new_id', 'dyad_name', 'side_a_dset_id', 'side_a_new_id', 'side_a',
       'side_b_dset_id', 'side_b_new_id', 'side_b', 'number_of_sources',
       'source_article', 'source_office', 'source_date', 'source_headline',
       'source_original', 'where_prec', 'where_coordinates',
       'where_description', 'adm_1', 'adm_2', 'latitude', 'longitude',
       'geom_wkt', 'priogrid_gid', 'country', 'country_id', 'region',
       'event_clarity', 'date_prec', 'date_start', 'date_end', 'deaths_a',
       'deaths_b', 'deaths_civilians', 'deaths_unknown', 'best', 'high', 'low',
       'gwnoa', 'gwnob'],
      dtype='object')

In [28]:
df.columns

Index(['id', 'relid', 'year', 'active_year', 'code_status', 'type_of_violence',
       'conflict_dset_id', 'conflict_new_id', 'conflict_name', 'dyad_dset_id',
       'dyad_new_id', 'dyad_name', 'side_a_dset_id', 'side_a_new_id', 'side_a',
       'side_b_dset_id', 'side_b_new_id', 'side_b', 'number_of_sources',
       'source_article', 'source_office', 'source_date', 'source_headline',
       'source_original', 'where_prec', 'where_coordinates',
       'where_description', 'adm_1', 'adm_2', 'latitude', 'longitude',
       'geom_wkt', 'priogrid_gid', 'country', 'country_id', 'region',
       'event_clarity', 'date_prec', 'date_start', 'date_end', 'deaths_a',
       'deaths_b', 'deaths_civilians', 'deaths_unknown', 'best', 'high', 'low',
       'gwnoa', 'gwnob'],
      dtype='object')

In [30]:
df[ ["year","country","latitude", "longitude"] ]

        year              country   latitude  longitude
0       2017          Afghanistan  34.531094  69.162796
1       1989          Afghanistan  34.333330  70.416670
2       1989          Afghanistan  36.750000  68.750000
3       1989          Afghanistan  35.315833  69.038889
4       1989          Afghanistan  34.531094  69.162796
...      ...                  ...        ...        ...
261859  1989  Zimbabwe (Rhodesia) -20.500000  32.500000
261860  1989  Zimbabwe (Rhodesia) -19.000000  32.500000
261861  1990  Zimbabwe (Rhodesia) -18.000000  32.833333
261862  1990  Zimbabwe (Rhodesia) -19.000000  32.500000
261863  1990  Zimbabwe (Rhodesia) -16.783333  31.583333

[261864 rows x 4 columns]

In [33]:
student_df

   name  gpa
0  mike  2.1
1   dan  2.7
2   deb  3.4

In [34]:
student_df['gpa'] < 3.0

0     True
1     True
2    False
Name: gpa, dtype: bool

In [35]:
student_df[ student_df['gpa'] < 3.0  ]

   name  gpa
0  mike  2.1
1   dan  2.7

In [45]:
from IPython.display import display, HTML
from ipywidgets import interact_manual
import pandas as pd

dataset = "/home/jovyan/datasets/ist256/UCDP-Georeferenced-Event-Dataset/v21.1/ged211.csv"
df = pd.read_csv(dataset)

countries = list(df["country"].unique())
years = list(df['year'].unique())
@interact_manual( country = countries, year = years )
def onclick(country,year):
    filtered_df = df[ (df["country"] == country) & (df['year'] == year) ]
    cols_df = filtered_df[["year","country","latitude", "longitude"]]
    display(cols_df)

/opt/conda/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3251: DtypeWarning: Columns (47) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

interactive(children=(Dropdown(description='country', options=('Afghanistan', 'Albania', 'Algeria', 'Angola', â€¦

In [ ]:
DATA FRAME OPERATORS
& AND
| OR
~ NOT